{"headline":0,"backend":1,"engineer":2,"sql":3,"spark":4,"cloud":5,"summary":6,"software":7,"data":8,"professional":9,"6":10,"9":11,"years":12,"experience":13,"building":14,"pipelines":15,"systems":16,"analytics":17,"infrastructure":18,"i":19,"m":20,"hybrid":21,"airflow":22,"warehouses":23,"home":24,"territory":25,"competence":26,"ml":27,"side":28,"my":29,"toolkit":30,"solid":31,"engineering":32,"python":33,"warehouse":34,"design":35,"ve":36,"completed":37,"couple":38,"self-directed":39,"projects":40,"kaggle":41,"competitions":42,"fine-tuning":43,"small":44,"models":45,"interested":46,"transitioning":47,"toward":48,"more":49,"ai":50,"ml-focused":51,"work":52,"ideally":53,"company":54,"where":55,"can":56,"leverage":57,"existing":58,"data-infra":59,"skills":60,"while":61,"learning":62,"modern":63,"practice":64,"title":65,"mindtree":66,"implemented":67,"streaming":68,"kafka":69,"real-time":70,"user-activity":71,"processing":72,"platform":73,"designed":74,"schema-registry":75,"integration":76,"watermark":77,"state":78,"management":79,"approach":80,"deduplication":81,"logic":82,"late-arriving":83,"events":84,"worked":85,"closely":86,"science":87,"team":88,"make":89,"sure":90,"feature":91,"aligned":92,"what":93,"needed":94,"most":95,"career":96,"has":97,"been":98,"some":99,"adjacent":100,"exposure":101,"dunder":102,"mifflin":103,"built":104,"maintained":105,"apache":106,"500gb":107,"daily":108,"transactional":109,"across":110,"12":111,"source":112,"extensively":113,"pyspark":114,"batch":115,"dbt":116,"transformation":117,"modeling":118,"layer":119,"our":120,"snowflake":121,"owned":122,"on-call":123,"rotation":124,"quality":125,"issues":126,"wrote":127,"checks":128,"detect":129,"schema":130,"drift":131,"unusual":132,"volume":133,"changes":134,"pipeline":135,"supports":136,"few":137,"internal":138,"expert":139,"advanced":140,"nlp":141,"image":142,"classification":143,"llms":144,"speech":145,"recognition":146,"tts":147,"milvus":148,"gans":149,"education":150,"b":151,"e":152,"computer":153,"operations":154,"manager":155,"5":156,"yrs":157,"background":158,"marketing":159,"led":160,"teams":161,"kpis":162,"driven":163,"business":164,"outcomes":165,"domain":166,"lately":167,"curious":168,"about":169,"how":170,"tools":171,"could":172,"augment":173,"experimented":174,"chatgpt":175,"other":176,"productivity":177,"content":178,"creation":179,"think":180,"space":181,"exciting":182,"open":183,"roles":184,"apply":185,"expertise":186,"alongside":187,"emerging":188,"capabilities":189,"wipro":190,"customer":191,"support":192,"lead":193,"saas":194,"product":195,"managed":196,"8":197,"agents":198,"handling":199,"tier-1":200,"tier-2":201,"tickets":202,"escalation":203,"process":204,"customer-feedback":205,"loop":206,"out":207,"knowledge":208,"base":209,"agent":210,"training":211,"program":212,"strong":213,"people-management":214,"lighter":215,"technical":216,"depth":217,"beyond":218,"mechanical":219,"role":220,"hardware-product":221,"two":222,"subsystems":223,"through":224,"full":225,"lifecycle":226,"concept":227,"dfm":228,"dfma":229,"review":230,"prototype":231,"production":232,"tooling":233,"comfortable":234,"cad":235,"solidworks":236,"creo":237,"fea":238,"ansys":239,"typical":240,"hardware-development":241,"cadence":242,"manufacturing":243,"partners":244,"scale-up":245,"acme":246,"corp":247,"writing":248,"seo":249,"strategy":250,"tech-focused":251,"publication":252,"longform":253,"articles":254,"developer":255,"platforms":256,"topics":257,"including":258,"ranked":259,"first":260,"page":261,"search":262,"high-competition":263,"keywords":264,"freelance":265,"writer":266,"pool":267,"editorial":268,"calendar":269,"recent":270,"ai-assisted":271,"using":272,"llm":273,"research":274,"drafting":275,"editing":276,"maintaining":277,"brand":278,"creative":279,"direction":280,"consumer-products":281,"identity":282,"logo":283,"visual":284,"system":285,"typography":286,"packaging":287,"digital":288,"web":289,"social":290,"rebrand":291,"external":292,"agency":293,"adobe":294,"suite":295,"figma":296,"sc":297,"mathematics":298,"1":299,"spent":300,"mostly":301,"focused":302,"driving":303,"people":304,"relationships":305,"tcs":306,"analyst":307,"consulting":308,"firm":309,"working":310,"primarily":311,"retail":312,"cpg":313,"clients":314,"conducted":315,"diagnostics":316,"re-engineering":317,"stakeholder":318,"structured":319,"problem-solving":320,"slide-craft":321,"excel":322,"executive":323,"communication":324,"project":325,"involved":326,"ai-strategy":327,"advisory":328,"own":329,"limited":330,"chemical":331,"information":332,"technology":333,"3":334,"infosys":335,"globex":336,"inc":337,"logistics":338,"fulfillment":339,"managing":340,"80":341,"receiving":342,"picking":343,"packing":344,"outbound":345,"tracked":346,"operational":347,"on-time":348,"accuracy":349,"cost":350,"per":351,"order":352,"continuous":353,"improvement":354,"initiatives":355,"drove":356,"22":357,"gain":358,"over":359,"18":360,"months":361,"tech":362,"machine":363,"ph":364,"d":365,"electronics":366,"accountant":367,"helping":368,"scale":369,"11":370,"0":371,"stark":372,"industries":373,"hr":374,"senior":375,"accounting":376,"mid-sized":377,"month-end":378,"close":379,"financial":380,"reporting":381,"statutory":382,"compliance":383,"gaap":384,"ind-as":385,"tax":386,"filings":387,"gl":388,"fixed-asset":389,"register":390,"audit-readiness":391,"function":392,"staff":393,"accountants":394,"discipline":395,"around":396,"cycle":397,"reducing":398,"time":399,"from":400,"days":401,"7":402,"last":403,"initech":404,"wayne":405,"enterprises":406,"pied":407,"piper":408,"artificial":409,"intelligence":410,"civil":411,"leadership":412,"b2b":413,"demand-generation":414,"paid":415,"acquisition":416,"email":417,"nurture":418,"performance":419,"sales":420,"lead-quality":421,"definitions":422,"sdr-handoff":423,"focus":424,"account-based":425,"enterprise":426,"segment":427,"solutions":428,"mid-market":429,"carried":430,"8m":431,"arr":432,"quota":433,"consistently":434,"delivered":435,"against":436,"three":437,"prospecting":438,"discovery":439,"evaluation":440,"se":441,"commercial":442,"negotiation":443,"consultative":444,"selling":445,"buyers":446,"engaging":447,"both":448,"finance":449,"stakeholders":450,"4":451,"shipped":452,"features":453,"s":454,"core":455,"day":456,"ola":457,"mixed":458,"analytics-engineering":459,"marketing-analytics":460,"startup":461,"maybe":462,"30":463,"lightweight":464,"clustering":465,"churn":466,"prediction":467,"sklearn":468,"xgboost":469,"70":470,"dashboards":471,"wouldn":472,"t":473,"call":474,"myself":475,"specialist":476,"experimentation":477,"framework":478,"tests":479,"opencv":480,"prompt":481,"object":482,"detection":483,"bm25":484,"weights":485,"biases":486,"qa":487,"devops":488,"2":489,"fundamentals":490,"development":491,"conventional":492,"apis":493,"databases":494,"queues":495,"deployments":496,"keeping":497,"up":498,"self-learner":499,"level":500,"taken":501,"online":502,"courses":503,"played":504,"openai":505,"anthropic":506,"rag":507,"haven":508,"done":509,"capacity":510,"yet":511,"either":512,"deepen":513,"start":514,"contributing":515,"ml-adjacent":516,"android":517,"mobile":518,"java":519,"recently":520,"kotlin":521,"consumer-app":522,"multiple":523,"main":524,"shopping":525,"flow":526,"push":527,"notification":528,"offline-first":529,"sync":530,"jetpack":531,"components":532,"patterns":533,"mvvm":534,"hilt":535,"coroutines":536,"entirely":537,"so":538,"far":539,"expanding":540,"broader":541,"hooli":542,"test":543,"automation":544,"fintech":545,"end-to-end":546,"selenium":547,"pytest":548,"plus":549,"load-testing":550,"setup":551,"locust":552,"developers":553,"testability":554,"acceptance":555,"criteria":556,"shifting":557,"responsibility":558,"dev":559,"moving":560,"qa-as-gate":561,"qa-as-coach":562,"recommendation":563,"kubeflow":564,"physics":565,"substantial":566,"cross-functional":567,"collaboration":568,"execution":569,"frontend":570,"full-stack":571,"comfort":572,"zone":573,"database":574,"zomato":575,"media":576,"react":577,"typescript":578,"surrounding":579,"webpack":580,"jest":581,"cypress":582,"scratch":583,"migration":584,"legacy":585,"angularjs":586,"app":587,"craft":588,"accessibility":589,"animations":590,"faiss":591,"opensearch":592,"yolo":593,"statistics":594,"frontends":595,"rest":596,"parts":597,"stack":598,"razorpay":599,"aws":600,"account":601,"architecture":602,"vpc":603,"iam":604,"networking":605,"terraform":606,"modules":607,"service":608,"kubernetes":609,"cluster":610,"ci":611,"cd":612,"gitlab":613,"argocd":614,"monitoring":615,"prometheus":616,"grafana":617,"loki":618,"infra":619,"ops":620,"much":621,"application":622,"large":623,"spring":624,"boot":625,"microservices":626,"inter-service":627,"messaging":628,"postgres":629,"redis":630,"storage":631,"onboarding":632,"which":633,"orchestrating":634,"downstream":635,"services":636,"ecosystem":637,"transaction":638,"looking":639,"go":640,"deeper":641,"distributed":642,"expand":643,"stacks":644,"cnn":645,"graphic":646,"designer":647,"enthusiast":648,"14":649,"have":650,"functional":651,"responsibilities":652,"delivery":653,"excited":654,"genai":655,"taking":656,"vector":657,"experimenting":658,"langchain":659,"api":660,"exploring":661,"streamline":662,"workflows":663,"current":664,"combine":665,"technologies":666,"interesting":667,"opportunities":668,"intersection":669,"positions":670,"contribute":671,"grow":672,"embeddings":673,"flipkart":674,"forecasting":675,"mahindra":676,"react-based":677,"admin":678,"interfaces":679,"node":680,"js":681,"backing":682,"them":683,"endpoint":684,"postgresql":685,"deployment":686,"via":687,"docker":688,"though":689,"testing":690,"peft":691,"10":692,"ranking":693,"retrieval":694,"ml-powered":695,"applied":696,"migrated":697,"keyword-search-based":698,"embedding-based":699,"learned":700,"problems":701,"actually":702,"disguise":703,"academic":704,"cs":705,"come":706,"shipping":707,"real":708,"seeing":709,"holds":710,"under":711,"load":712,"ic":713,"companies":714,"meaningful":715,"piece":716,"swiggy":717,"trained":718,"feed":719,"lightgbm":720,"families":721,"metadata":722,"user":723,"behavior":724,"signals":725,"item":726,"engagement":727,"history":728,"offline-online":729,"correlation":730,"analysis":731,"determined":732,"offline":733,"metrics":734,"predicted":735,"pms":736,"define":737,"optimization":738,"target":739,"click-through":740,"vs":741,"dwell":742,"conversion":743,"important":744,"itself":745,"mad":746,"street":747,"den":748,"uber":749,"e-commerce":750,"evolving":751,"hand-tuned":752,"scoring":753,"learning-to-rank":754,"model":755,"relevance":756,"labeling":757,"mix":758,"explicit":759,"human":760,"judgments":761,"eval":762,"workflow":763,"part":764,"almost":765,"easy":766,"bit":767,"final":768,"improved":769,"revenue-per-search":770,"mlflow":771,"pinecone":772,"hugging":773,"face":774,"transformers":775,"sentence":776,"scikit-learn":777,"net":778,"cognizant":779,"hcl":780,"bentoml":781,"commerce":782,"weaviate":783,"electrical":784,"mba":785,"13":786,"elasticsearch":787,"haystack":788,"reinforcement":789,"django":790,"cred":791,"mphasis":792,"pytorch":793,"statistical":794,"accenture":795,"mlops":796,"qdrant":797,"generative":798,"explorer":799,"started":800,"gradually":801,"moved":802,"closer":803,"etl":804,"now":805,"basic":806,"semantic":807,"rank":808,"diffusion":809,"series":810,"scientist":811,"predictive":812,"nlp-based":813,"extraction":814,"strongest":815,"pandas":816,"standard":817,"still":818,"step":819,"ownership":820,"just":821,"sentiment":822,"document":823,"feedback-analytics":824,"dashboard":825,"sklearn-based":826,"bag-of-words":827,"transformer-based":828,"classifiers":829,"distilbert":830,"harder":831,"classes":832,"datasets":833,"pre-trained":834,"from-scratch":835,"llamaindex":836,"lora":837,"applications":838,"vision":839,"upgrad":840,"growth-stage":841,"proper":842,"migrating":843,"tangled":844,"set":845,"replicas":846,"clean":847,"orchestration":848,"bi":849,"looker":850,"bulk":851,"unacademy":852,"analytical":853,"supporting":854,"50":855,"complex":856,"heavy":857,"window":858,"functions":859,"ctes":860,"incremental":861,"dimensional":862,"slowly":863,"changing":864,"dimensions":865,"well":866,"query":867,"tuning":868,"sizing":869,"materialized":870,"views":871,"also":872,"lineage":873,"documentation":874,"use":875,"org":876,"asr":877,"system-building":878,"moderation":879,"fine-tuned":880,"resnet":881,"variants":882,"labeled":883,"dataset":884,"200k":885,"images":886,"loading":887,"augmentation":888,"inference":889,"cv":890,"byju":891,"contributed":892,"fraud-detection":893,"flask-based":894,"integrating":895,"store":896,"model-serving":897,"observability":898,"scientists":899,"secondary":900,"production-side":901,"tensorflow":902,"paytm":903,"fastapi":904,"analytics-and-reporting":905,"serves":906,"3k":907,"paying":908,"customers":909,"includes":910,"another":911,"reliability":912,"want":913,"get":914,"serious":915,"surface":916,"aganitha":917,"customer-facing":918,"likelihood":919,"lifetime":920,"value":921,"estimation":922,"used":923,"were":924,"gradient-boosted":925,"trees":926,"hand-engineered":927,"split":928,"roughly":929,"60":930,"40":931,"between":932,"prep":933,"retention":934,"than":935,"productionization":936,"who":937,"makes":938,"possible":939,"getting":940,"right":941,"do":942,"freshworks":943,"nykaa":944,"phonepe":945,"recommendation-style":946,"mid-stage":947,"weight":948,"faang":949,"combination":950,"collaborative":951,"filtering":952,"matrix":953,"factorization":954,"implicit-feedback":955,"library":956,"re-ranking":957,"pure":958,"handled":959,"yellow":960,"time-series":961,"supply-chain":962,"demand":963,"prophet":964,"one":965,"lstm":966,"ended":967,"ran":968,"experiments":969,"dynamic":970,"pricing":971,"those":972,"didn":973,"capgemini":974,"vedantu":975,"15":976,"qlora":977,"pgvector":978,"dashboarding":979,"haptik":980,"saarthi":981,"rephrase":982,"inmobi":983,"dream11":984,"meesho":985,"deep":986,"pharmeasy":987,"junior":988,"zoho":989,"deep-learning":990,"classical":991,"methods":992,"like":993,"wysa":994,"genpact":995,"glance":996,"niramai":997,"policybazaar":998,"observe":999,"intelligent":1000,"products":1001,"sentence-transformers":1002,"works":1003,"enough":1004,"debugging":1005,"know":1006,"matter":1007,"noise":1008,"developed":1009,"500k":1010,"documents":1011,"all-minilm-l6-v2":1012,"initially":1013,"later":1014,"upgraded":1015,"bge-base":1016,"fast":1017,"nearest-neighbor":1018,"expansion":1019,"module":1020,"handles":1021,"vocabulary":1022,"mismatch":1023,"queries":1024,"terms":1025,"reported":1026,"search-relevance":1027,"35":1028,"prior":1029,"validated":1030,"serving":1031,"10m":1032,"users":1033,"combined":1034,"content-based":1035,"uses":1036,"item-item":1037,"similarity":1038,"sentence-transformer":1039,"cold":1040,"starts":1041,"warm":1042,"went":1043,"200":1044,"launch":1045,"7-day":1046,"session":1047,"ai-native":1048,"hands-on":1049,"combining":1050,"dense":1051,"recall":1052,"corpus":1053,"30m":1054,"candidate":1055,"profiles":1056,"day-to-day":1057,"spans":1058,"embedding":1059,"selection":1060,"behavioral-signal":1061,"ties":1062,"all":1063,"together":1064,"early-stage":1065,"larger":1066,"tradeoffs":1067,"care":1068,"weeks":1069,"theoretically":1070,"perfect":1071,"currently":1072,"next":1073,"move":1074,"tech-lead":1075,"apple":1076,"marketplace":1077,"going":1078,"live":1079,"tf-idf":1080,"behavioral":1081,"challenge":1082,"cold-start":1083,"problem":1084,"new":1085,"exploration-exploitation":1086,"policy":1087,"thompson":1088,"sampling":1089,"new-user":1090,"month":1091,"llama-2-7b":1092,"mistral-7b":1093,"domain-specific":1094,"candidate-jd":1095,"matching":1096,"curation":1097,"generated":1098,"high-quality":1099,"preference":1100,"pairs":1101,"recruiter":1102,"labels":1103,"harness":1104,"human-quality":1105,"scores":1106,"deployed":1107,"sub-200ms":1108,"p95":1109,"latency":1110,"quantizing":1111,"int8":1112,"batching":1113,"request":1114,"dropped":1115,"04":1116,"gpt-3":1117,"5-fallback":1118,"001":1119,"locobuzz":1120,"verloop":1121,"io":1122,"krutrim":1123,"photoshop":1124,"sarvam":1125,"lot":1126,"rigor":1127,"too":1128,"many":1129,"ship":1130,"without":1131,"benchmarks":1132,"trust":1133,"google":1134,"ex-top":1135,"operating":1136,"single-digit-millisecond":1137,"believe":1138,"solved":1139,"careful":1140,"rigorous":1141,"bigger":1142,"netflix":1143,"rag-based":1144,"50m":1145,"recruiter-facing":1146,"bge":1147,"hnsw":1148,"llm-based":1149,"re-ranker":1150,"top-50":1151,"falling":1152,"back":1153,"when":1154,"budget":1155,"tight":1156,"ndcg":1157,"mrr":1158,"k":1159,"calibrated":1160,"recruiter-feedback":1161,"surfaced":1162,"reranking":1163,"edge":1164,"cases":1165,"several":1166,"connect":1167,"relevant":1168,"algorithms":1169,"middle":1170,"decide":1171,"show":1172,"research-only":1173,"rather":1174,"v1":1175,"v2":1176,"made":1177,"mistakes":1178,"over-engineering":1179,"early":1180,"optimizing":1181,"numbers":1182,"beautiful":1183,"notice":1184,"faster":1185,"processed":1186,"billions":1187,"served":1188,"millions":1189,"low":1190,"effort":1191,"boring-but-essential":1192,"index":1193,"refresh":1194,"understanding":1195,"calibration":1196,"legible":1197,"had":1198,"understand":1199,"matches":1200,"judgment":1201,"none":1202,"optional":1203,"complete":1204,"overhaul":1205,"took":1206,"heuristic":1207,"grew":1208,"me":1209,"engineers":1210,"course":1211,"representations":1212,"natural":1213,"language":1214,"along":1215,"way":1216,"gotten":1217,"retraining":1218,"schedules":1219,"chatbot":1220,"integrated":1221,"ticketing":1222,"ingestion":1223,"chunking":1224,"storing":1225,"answer-generation":1226,"gpt-4":1227,"smaller":1228,"control":1229,"automatic":1230,"bleu":1231,"rouge":1232,"human-in-the-loop":1233,"cut":1234,"average":1235,"ticket":1236,"resolution":1237,"31":1238,"supported":1239,"categories":1240,"amazon":1241,"operated":1242,"experiment":1243,"tracking":1244,"success":1245,"prioritize":1246,"outreach":1247,"distribution":1248,"alerting":1249,"mentored":1250,"year":1251,"meta":1252,"consumer":1253,"represented":1254,"internally":1255,"results":1256,"appear":1257,"each":1258,"intent":1259,"spanned":1260,"methodology":1261,"direct":1262,"pm":1263,"means":1264,"fair":1265,"amount":1266,"correlated":1267,"turned":1268,"hardest":1269,"personalization":1270,"learns":1271,"improves":1272,"environment":1273,"feature-engineering":1274,"connected":1275,"boring-but-critical":1276,"growth":1277,"adaptation":1278,"text":1279,"encoders":1280,"peak":1281,"qps":1282,"8k":1283,"recommendations-heavy":1284,"sourcing":1285,"generation":1286,"bge-large":1287,"re-scoring":1288,"wasn":1289,"would":1290,"after":1291,"iterations":1292,"we":1293,"landed":1294,"simulated":1295,"held":1296,"de-facto":1297,"recsys":1298,"linkedin":1299,"powers":1300,"salesforce":1301,"rebuilt":1302,"72":1303,"91":1304,"everything":1305,"before":1306,"defining":1307,"metric":1308,"over-investing":1309,"don":1310,"rollout":1311,"large-scale":1312,"35m":1313,"items":1314,"bm25-only":1315,"sparse":1316,"vectors":1317,"mpnet-base":1318,"reduced":1319,"improving":1320,"held-out":1321,"microsoft":1322,"footprint":1323,"600gb":1324,"every":1325,"min":1326,"hadoop":1327,"opinions":1328,"hammer":1329,"ir":1330,"usually":1331,"databricks":1332,"angular":1333,"html":1334,"javascript":1335,"bigquery":1336,"six":1337,"sigma":1338,"grpc":1339,"sap":1340,"gcp":1341,"rust":1342,"flagship":1343,"thing":1344,"hard":1345,"rarely":1346,"fed":1347,"told":1348,"us":1349,"whether":1350,"healthy":1351,"indexing":1352,"redux":1353,"powerpoint":1354,"keyword-based":1355,"successive":1356,"ranker":1357,"keyword":1358,"24":1359,"time-to-shortlist":1360,"38":1361,"boring":1362,"versioning":1363,"rollback":1364,"paths":1365,"let":1366,"recruiters":1367,"vue":1368,"flask":1369,"css":1370,"scrum":1371,"embedded":1372,"crm":1373,"mongodb":1374,"agile":1375,"azure":1376,"tally":1377,"open-source":1378,"libraries":1379,"graphql":1380,"illustrator":1381,"heart":1382,"":1383}